batch_vs_layer_example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fri 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Batch Normalization vs Layer Normalization - Simple Example</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Batch Normalization vs Layer Normalization - Simple Example</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org13f9947">1. Scenario</a>
<ul>
<li><a href="#orgaa464cf">1.1. Input Batch (2 examples, 3 features each):</a></li>
<li><a href="#orgb106d19">1.2. Hidden Layer Output (Before Normalization):</a></li>
</ul>
</li>
<li><a href="#org4cfa40e">2. 1. Batch Normalization</a>
<ul>
<li><a href="#orgb3b0dd9">2.1. Steps:</a></li>
<li><a href="#orgcc02e75">2.2. Key Point:</a></li>
</ul>
</li>
<li><a href="#orgd777431">3. 2. Layer Normalization</a>
<ul>
<li><a href="#org6b95e7b">3.1. Steps:</a></li>
<li><a href="#org8147506">3.2. Key Point:</a></li>
</ul>
</li>
<li><a href="#org9b3f3f3">4. Comparison</a></li>
<li><a href="#orgeb9ca3d">5. Intuition</a></li>
</ul>
</div>
</div>
<div id="outline-container-org13f9947" class="outline-2">
<h2 id="org13f9947"><span class="section-number-2">1.</span> Scenario</h2>
<div class="outline-text-2" id="text-1">
<p>
We have a neural network with one hidden layer. The hidden layer has <b><b>3 neurons</b></b>, and we are processing a <b><b>batch of 2 examples</b></b>. Each example has <b><b>3 features</b></b>.
</p>
</div>
<div id="outline-container-orgaa464cf" class="outline-3">
<h3 id="orgaa464cf"><span class="section-number-3">1.1.</span> Input Batch (2 examples, 3 features each):</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">X</span> = [
  [<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>],  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 1</span>
  [<span style="color: #da8548; font-weight: bold;">4</span>, <span style="color: #da8548; font-weight: bold;">5</span>, <span style="color: #da8548; font-weight: bold;">6</span>]   <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 2</span>
]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb106d19" class="outline-3">
<h3 id="orgb106d19"><span class="section-number-3">1.2.</span> Hidden Layer Output (Before Normalization):</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Assume the hidden layer produces the following outputs for the batch:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">H</span> = [
  [<span style="color: #da8548; font-weight: bold;">10</span>, <span style="color: #da8548; font-weight: bold;">20</span>, <span style="color: #da8548; font-weight: bold;">30</span>],  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 1</span>
  [<span style="color: #da8548; font-weight: bold;">40</span>, <span style="color: #da8548; font-weight: bold;">50</span>, <span style="color: #da8548; font-weight: bold;">60</span>]   <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 2</span>
]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4cfa40e" class="outline-2">
<h2 id="org4cfa40e"><span class="section-number-2">2.</span> 1. Batch Normalization</h2>
<div class="outline-text-2" id="text-2">
<p>
Batch normalization normalizes <b><b>across the batch dimension</b></b> for each feature (neuron output). It computes the mean and variance for each column (neuron) across all examples in the batch.
</p>
</div>
<div id="outline-container-orgb3b0dd9" class="outline-3">
<h3 id="orgb3b0dd9"><span class="section-number-3">2.1.</span> Steps:</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Compute mean and variance for each feature (column):
<ul class="org-ul">
<li>For the first feature (first column): [10, 40]
<ul class="org-ul">
<li>Mean: μ₁ = (10 + 40) / 2 = 25</li>
<li>Variance: σ₁² = [(10-25)² + (40-25)²] / 2 = 225</li>
</ul></li>
<li>For the second feature (second column): [20, 50]
<ul class="org-ul">
<li>Mean: μ₂ = (20 + 50) / 2 = 35</li>
<li>Variance: σ₂² = [(20-35)² + (50-35)²] / 2 = 225</li>
</ul></li>
<li>For the third feature (third column): [30, 60]
<ul class="org-ul">
<li>Mean: μ₃ = (30 + 60) / 2 = 45</li>
<li>Variance: σ₃² = [(30-45)² + (60-45)²] / 2 = 225</li>
</ul></li>
</ul></li>

<li>Normalize each feature using its mean and variance:
<ul class="org-ul">
<li>For the first feature:
<ul class="org-ul">
<li>BN(10) = (10 - 25) / √225 = -1</li>
<li>BN(40) = (40 - 25) / √225 = 1</li>
</ul></li>
<li>For the second feature:
<ul class="org-ul">
<li>BN(20) = (20 - 35) / √225 = -1</li>
<li>BN(50) = (50 - 35) / √225 = 1</li>
</ul></li>
<li>For the third feature:
<ul class="org-ul">
<li>BN(30) = (30 - 45) / √225 = -1</li>
<li>BN(60) = (60 - 45) / √225 = 1</li>
</ul></li>
</ul></li>

<li>Final Normalized Output:</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">H_BN</span> = [
  [-<span style="color: #da8548; font-weight: bold;">1</span>, -<span style="color: #da8548; font-weight: bold;">1</span>, -<span style="color: #da8548; font-weight: bold;">1</span>],  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 1</span>
  [<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">1</span>]      <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 2</span>
]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc02e75" class="outline-3">
<h3 id="orgcc02e75"><span class="section-number-3">2.2.</span> Key Point:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Batch normalization normalizes <b><b>across the batch</b></b> for each feature. It uses the statistics (mean and variance) of the entire batch.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd777431" class="outline-2">
<h2 id="orgd777431"><span class="section-number-2">3.</span> 2. Layer Normalization</h2>
<div class="outline-text-2" id="text-3">
<p>
Layer normalization normalizes <b><b>across the feature dimension</b></b> for each example. It computes the mean and variance for each row (example) across all features.
</p>
</div>
<div id="outline-container-org6b95e7b" class="outline-3">
<h3 id="org6b95e7b"><span class="section-number-3">3.1.</span> Steps:</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Compute mean and variance for each example (row):
<ul class="org-ul">
<li>For the first example: [10, 20, 30]
<ul class="org-ul">
<li>Mean: μ₁ = (10 + 20 + 30) / 3 = 20</li>
<li>Variance: σ₁² = [(10-20)² + (20-20)² + (30-20)²] / 3 = 66.67</li>
</ul></li>
<li>For the second example: [40, 50, 60]
<ul class="org-ul">
<li>Mean: μ₂ = (40 + 50 + 60) / 3 = 50</li>
<li>Variance: σ₂² = [(40-50)² + (50-50)² + (60-50)²] / 3 = 66.67</li>
</ul></li>
</ul></li>

<li>Normalize each example using its mean and variance:
<ul class="org-ul">
<li>For the first example:
<ul class="org-ul">
<li>LN(10) = (10 - 20) / √66.67 ≈ -1.22</li>
<li>LN(20) = (20 - 20) / √66.67 = 0</li>
<li>LN(30) = (30 - 20) / √66.67 ≈ 1.22</li>
</ul></li>
<li>For the second example:
<ul class="org-ul">
<li>LN(40) = (40 - 50) / √66.67 ≈ -1.22</li>
<li>LN(50) = (50 - 50) / √66.67 = 0</li>
<li>LN(60) = (60 - 50) / √66.67 ≈ 1.22</li>
</ul></li>
</ul></li>

<li>Final Normalized Output:</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">H_LN</span> = [
  [-<span style="color: #da8548; font-weight: bold;">1.22</span>, <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1.22</span>],  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 1</span>
  [-<span style="color: #da8548; font-weight: bold;">1.22</span>, <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1.22</span>]   <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Example 2</span>
]
</pre>
</div>
</div>
</div>
<div id="outline-container-org8147506" class="outline-3">
<h3 id="org8147506"><span class="section-number-3">3.2.</span> Key Point:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Layer normalization normalizes <b><b>across the features</b></b> for each example. It uses the statistics (mean and variance) of each individual example.
</p>
</div>
</div>
</div>
<div id="outline-container-org9b3f3f3" class="outline-2">
<h2 id="org9b3f3f3"><span class="section-number-2">4.</span> Comparison</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b><b>Normalization</b></b></th>
<th scope="col" class="org-left"><b><b>Batch Normalization</b></b></th>
<th scope="col" class="org-left"><b><b>Layer Normalization</b></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Normalization Axis</b></b></td>
<td class="org-left">Across the batch (rows) for each feature (column)</td>
<td class="org-left">Across the features (columns) for each example (row)</td>
</tr>

<tr>
<td class="org-left"><b><b>Example 1</b></b></td>
<td class="org-left">Normalizes [10, 40]</td>
<td class="org-left">Normalizes [10, 20, 30]</td>
</tr>

<tr>
<td class="org-left"><b><b>Example 2</b></b></td>
<td class="org-left">Normalizes [20, 50]</td>
<td class="org-left">Normalizes [40, 50, 60]</td>
</tr>

<tr>
<td class="org-left"><b><b>Output</b></b></td>
<td class="org-left">[[-1, -1, -1], [1, 1, 1]]</td>
<td class="org-left">[[-1.22, 0, 1.22], [-1.22, 0, 1.22]]</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgeb9ca3d" class="outline-2">
<h2 id="orgeb9ca3d"><span class="section-number-2">5.</span> Intuition</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b><b>Batch Normalization:</b></b> Normalizes the outputs of each neuron across all examples in the batch. Ensures consistent scale across the batch.</li>
<li><b><b>Layer Normalization:</b></b> Normalizes the outputs of all neurons for each example individually. Ensures consistent scale within each example.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-24 Fri 14:59</p>
</div>
</body>
</html>
